<a href="https://colab.research.google.com/github/jumbokh/csu1112-class/blob/main/notebooks/20210927_Pandas%E7%B7%B4%E7%BF%92.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 練習一

產生一個測試用的DataFrame, 從底下字串中抽取中文姓名當索引。使用 randint 產生亂數成績。

許淑軒、黃孟修、張維紹、王志玲、張瑋雲、彭穎夢、黃益如、吳穎竹、林曉宸、蔡筱孜、翁韻如、蕭有菱、孫珈丞、魏玟君、戴馨儀、金兆寧、林月昕、姚志遠、林琪珮、楊婉緯、陳鳳丞、羅佳芳、林怡君、劉鈺中、朱淑娟、張秋燕、汪珮瑜、夏政一、蔡佩威、高萱萍、曾桂心、王俊毅、莫亮竹、陳冠明、黃涵綸、張阿玄、吳哲維、黃玉生、殷其偉、周依萍、柯冠合、賴雅竹、黃淑玲、劉俊成、林培幸、陳岱迪、吳秉羽、廖翠柏、李美任、郭怡臻、盧佩怡、杜淑娟、別雨岑、陳柏城、黃法夫、張雅婷、詹文賢、林怡信、陳中城、許淑娟、王瑋倫、李俊倫、鄭佳穎、賁憲佐、吳偉倫、賴鴻駿、黃馨慧、許曜宇、張嬌紋、許涵光、廖駿漢、陸富一、邱怡婷、朱軍吟、涂涵峰、懷珍水、牛嘉豪、廖婉哲、黃之明、劉佳芳、潘佩璇、張麗雯、倪建年、高奇慧、楊安月、陳裕伶、幸定學、杜萬丞、黃勳方、林秀凱、方志偉、李俊宏、劉玉婷、姚綠良、郭益海、童雅君、陳金鳳、張呈忠、黃智傑、吳秉傑

In [ ]:
names = "許淑軒、黃孟修、張維紹、王志玲、張瑋雲、彭穎夢、黃益如、吳穎竹、林曉宸、蔡筱孜、翁韻如、蕭有菱、孫珈丞、魏玟君、戴馨儀、金兆寧、林月昕、姚志遠、林琪珮、楊婉緯、陳鳳丞、羅佳芳、林怡君、劉鈺中、朱淑娟、張秋燕、汪珮瑜、夏政一、蔡佩威、高萱萍、曾桂心、王俊毅、莫亮竹、陳冠明、黃涵綸、張阿玄、吳哲維、黃玉生、殷其偉、周依萍、柯冠合、賴雅竹、黃淑玲、劉俊成、林培幸、陳岱迪、吳秉羽、廖翠柏、李美任、郭怡臻、盧佩怡、杜淑娟、別雨岑、陳柏城、黃法夫、張雅婷、詹文賢、林怡信、陳中城、許淑娟、王瑋倫、李俊倫、鄭佳穎、賁憲佐、吳偉倫、賴鴻駿、黃馨慧、許曜宇、張嬌紋、許涵光、廖駿漢、陸富一、邱怡婷、朱軍吟、涂涵峰、懷珍水、牛嘉豪、廖婉哲、黃之明、劉佳芳、潘佩璇、張麗雯、倪建年、高奇慧、楊安月、陳裕伶、幸定學、杜萬丞、黃勳方、林秀凱、方志偉、李俊宏、劉玉婷、姚綠良、郭益海、童雅君、陳金鳳、張呈忠、黃智傑、吳秉傑"

In [ ]:
namelist = names.split('、')

In [ ]:
len(namelist)

100

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = np.random.randint(20, 101, (100, 4))

In [ ]:
df = pd.DataFrame(data, index=namelist)

In [ ]:
df.head()

      0    1   2   3
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

In [ ]:
df.columns = ['國文','英文','數學','理化']

In [ ]:
df.head()

     國文   英文  數學  理化
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

# 練習二

如何計算各科平均？各科最高分？各科最低分？

In [ ]:
df.head()

     國文   英文  數學  理化
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

In [ ]:
df.mean()

國文    60.94
英文    62.69
數學    58.58
理化    61.58
dtype: float64

In [ ]:
df.max()

國文    100
英文    100
數學    100
理化    100
dtype: int64

In [ ]:
df.min()

國文    20
英文    20
數學    20
理化    20
dtype: int64

# 練習三

如何計算個人總分？

In [ ]:
df.head()

     國文   英文  數學  理化
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

In [ ]:
df.sum(axis=1)

許淑軒    234
黃孟修    193
張維紹    171
王志玲    276
張瑋雲    231
      ...
童雅君    208
陳金鳳    269
張呈忠    246
黃智傑    187
吳秉傑    273
Length: 100, dtype: int64

# 練習四

將個人總分放入DataFrame的新的欄位裡面。

In [ ]:
df.head()

     國文   英文  數學  理化
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

In [ ]:
df['總分'] = df.sum(axis=1)

In [ ]:
df.head()

     國文   英文  數學  理化   總分
許淑軒  89   73  29  43  234
黃孟修  39   26  68  60  193
張維紹  48   24  28  71  171
王志玲  50  100  88  38  276
張瑋雲  87   89  35  20  231

# 練習五

查詢個人成績。

如：賴雅竹

In [ ]:
df.head()

     國文   英文  數學  理化   總分
許淑軒  89   73  29  43  234
黃孟修  39   26  68  60  193
張維紹  48   24  28  71  171
王志玲  50  100  88  38  276
張瑋雲  87   89  35  20  231

In [ ]:
df.loc['賴雅竹']

國文     73
英文     37
數學     95
理化     47
總分    252
Name: 賴雅竹, dtype: int64

# 練習六

查詢總成績前三名！

In [ ]:
df.head()

     國文   英文  數學  理化   總分
許淑軒  89   73  29  43  234
黃孟修  39   26  68  60  193
張維紹  48   24  28  71  171
王志玲  50  100  88  38  276
張瑋雲  87   89  35  20  231

In [ ]:
df.sort_values('總分',ascending=False).head(3)

     國文  英文  數學  理化   總分
金兆寧  69  95  86  91  341
翁韻如  73  88  93  83  337
夏政一  86  56  95  98  335

# 練習七

如何刪掉總分那個欄位？

In [ ]:
df.head()

     國文   英文  數學  理化   總分
許淑軒  89   73  29  43  234
黃孟修  39   26  68  60  193
張維紹  48   24  28  71  171
王志玲  50  100  88  38  276
張瑋雲  87   89  35  20  231

In [ ]:
df = df.drop('總分', axis=1)

In [ ]:
df.head()

     國文   英文  數學  理化
許淑軒  89   73  29  43
黃孟修  39   26  68  60
張維紹  48   24  28  71
王志玲  50  100  88  38
張瑋雲  87   89  35  20

# 練習八

請加入社會科的欄位，並重新計算總分！

In [ ]:
df['社會'] = np.random.randint(20, 100, (100,))

In [ ]:
df.head()

     國文   英文  數學  理化  社會
許淑軒  89   73  29  43  51
黃孟修  39   26  68  60  74
張維紹  48   24  28  71  38
王志玲  50  100  88  38  35
張瑋雲  87   89  35  20  97

In [ ]:
df['總分'] = df.sum(axis=1)

In [ ]:
df.head()

     國文   英文  數學  理化  社會   總分
許淑軒  89   73  29  43  51  285
黃孟修  39   26  68  60  74  267
張維紹  48   24  28  71  38  209
王志玲  50  100  88  38  35  311
張瑋雲  87   89  35  20  97  328

In [ ]:
df.to_excel('成績.xlsx')